In [1]:
import pyodbc
import pandas as pd

In [11]:
conn = pyodbc.connect(
    r"Driver={SQL Server};"
    r"Server=DESKTOP-0EH64EA\SQLEXPRESS;"
    r"Database=KarimProject;"
    r"Trusted_Connection=yes;"
)

In [13]:
pd.read_sql("SELECT name FROM sys.tables", conn)

C:\Users\DELL\AppData\Local\Temp\ipykernel_18036\3521680879.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql("SELECT name FROM sys.tables", conn)

                name
0         fact_sales
1      fact_shipment
2    fact_production
3   fact_procurement
4     fact_inventory
5       dim_supplier
6        dim_product
7       dim_facility
8           dim_date
9       dim_customer
10       sysdiagrams

In [25]:
fact_production = pd.read_sql("SELECT * FROM fact_production", conn)
fact_sales      = pd.read_sql("SELECT * FROM fact_sales", conn)
fact_shipment   = pd.read_sql("SELECT * FROM fact_shipment", conn)
fact_procurement =pd.read_sql("")
dim_product  = pd.read_sql("SELECT * FROM dim_product", conn)
dim_facility = pd.read_sql("SELECT * FROM dim_facility", conn)
dim_customer = pd.read_sql("SELECT * FROM dim_customer", conn)
dim_date     = pd.read_sql("SELECT * FROM dim_date", conn)

C:\Users\DELL\AppData\Local\Temp\ipykernel_18036\2005869436.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  fact = pd.read_sql("SELECT * FROM fact_production", conn)
C:\Users\DELL\AppData\Local\Temp\ipykernel_18036\2005869436.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  facility = pd.read_sql("SELECT * FROM dim_facility", conn)
C:\Users\DELL\AppData\Local\Temp\ipykernel_18036\2005869436.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  product = pd.read_sql("SELECT * FROM dim_product", conn)
C:\Users\DELL\AppData\Local\Temp\ipykernel_18036\2005869436.py:4: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  date = pd.read_sql("SELECT * FROM dim_date", conn)

,production_id,date_key,product_id,facility_id,quantity_produced,defective_units,defect_rate_pct,batch_number
0,1,376,11,3,60,0.0,1.13,PROD-2024017422
1,2,78,13,3,81,0.0,0.74,PROD-2023039595
2,3,441,4,1,1997,23.0,1.20,PROD-2024033020
3,4,161,1,3,1703,12.0,0.74,PROD-2023068538
4,5,529,13,2,40,0.0,0.33,PROD-2024062367

In [27]:
facility.head()

,facility_id,facility_key,facility_name,country,city,facility_type,specialization,annual_capacity
0,1,FAC-KR-GUM-P1,Gumi Manufacturing 1,South Korea,Gumi,Manufacturing,Smartphone,850000
1,2,FAC-VN-TNG-P1,Thai Nguyen Plant,Vietnam,Thai Nguyen,Manufacturing,Mobile Assembly,1500000
2,3,FAC-KR-GUM-P3,Gumi Appliance Plant,South Korea,Gumi,Manufacturing,Appliances,320000
3,4,WH-US-NJ-DC1,New Jersey DC,USA,Cranbury,Warehouse,North America,500000
4,5,WH-EU-PL-DC1,Poland DC,Poland,Warsaw,Warehouse,Europe,520000

In [29]:
product.head()

,product_id,product_key,product_name,category,product_line,spec,color,unit_price,unit_cost,weight_kg,Img
0,1,SM-S928UZKAXAA,Galaxy S24 Ultra,Smartphone,Galaxy S,512GB,Phantom Black,1299.99,899.99,0.21,https://i.ibb.co/9Hv19S22/s24-Ultra.webp\r
1,2,SM-S928UZAAXAA,Galaxy S24 Ultra,Smartphone,Galaxy S,256GB,Titanium Gray,1199.99,839.99,0.15,https://i.ibb.co/9Hv19S22/s24-Ultra.webp\r
2,3,SM-S921ULVAXAA,Galaxy S24,Smartphone,Galaxy S,256GB,Cobalt Violet,849.99,594.99,0.18,https://i.ibb.co/gMJgXrhG/s24.webp\r
3,4,SM-S911UCEAXAA,Galaxy S23,Smartphone,Galaxy S,128GB,Cream,699.99,489.99,0.17,https://i.ibb.co/tPH2nTkP/s23.webp\r
4,5,SM-F946UZKAXAA,Galaxy Z Fold5,Smartphone,Galaxy Z,512GB,Phantom Black,1919.99,1343.99,0.22,https://i.ibb.co/tPnpz3yp/Folf5.webp\r

In [31]:
date.head()

,date_key,full_date,year,quarter,month,month_name,week,day,day_of_week,day_name,is_weekend
0,1,2023-01-01,2023,1,1,January,52,1,6,Sunday,1
1,2,2023-01-02,2023,1,1,January,1,2,0,Monday,0
2,3,2023-01-03,2023,1,1,January,1,3,1,Tuesday,0
3,4,2023-01-04,2023,1,1,January,1,4,2,Wednesday,0
4,5,2023-01-05,2023,1,1,January,1,5,3,Thursday,0